scripts/artillery-smoke.yml
config:
  target: "{{ $env.TARGET_URL }}"
  phases:
    - duration: 30
      arrivalRate: 2
  plugins:
    ensure:
      thresholds:
        - http.response_time.p99: 1000
        - vusers.failed: 1

scenarios:
  - name: proxy health and web shell
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200
      - get:
          url: "/"
          expect:
            - statusCode: 200